# DeleteAllComponents

## Description
Deletes all components in an object.

```pascal
FUNCTION DeleteAllComponents(obj : HANDLE): BOOLEAN;
```

```python
def vs.DeleteAllComponents(obj):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE|The object. Can be a wall, round wall, Wall Style, or the Wall Preferences.|

## Remarks
*\_c\_*: 2016.02.03:  As of VW 2016 it doesn't work on other slab types such as Slab styles, Roof Styles. Use DeleteComponent looping by index.

## Examples
```pascal
resultOK := DeleteAllComponents(obj);
```
```python
import vs

# Deletes all components in an object.
obj = vs.FSActLayer()  # handle to the first selected object on the active layer

ok = vs.DeleteAllComponents(obj)
if ok:
    vs.Message('DeleteAllComponents succeeded')
else:
    vs.Message('DeleteAllComponents failed')
```

## Version
Availability: from VectorWorks 12.5

## Category
* Objects - Architectural